tests/fixtures/add-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <ns1:add xmlns:ns1="urn:calculator">
      <a xsi:type="xsd:int">2</a>
      <b xsi:type="xsd:int">3</b>
    </ns1:add>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
